#+CATEGORY: Desatero open
#+DATE: <2020-08-14 pá>
#+TITLE: Název
#+AUTHOR: autor
#+PRIORITIES: 1 5 3
#+LANGUAGE: cs
#+OPTIONS: H:4 toc:nil prop:1
#+TODO: NEZAHÁJENO(n) ZADÁNO(z) ROZPRACOVANÉ(r) DODĚLAT(d) POKOREKTUŘE UPRAVOVÁNO(u) | KEKOREKTUŘE(k) HOTOVO(h) FINÁLNÍ(f) AKTUALIZOVÁNO(a@)
#+STARTUP: fninline
* ROZPRACOVANÉ Desatero hlavních kroků k otevřeným řešením ICT v úřadu
  :LOGBOOK:
  CLOCK: [2021-12-10 Fri 07:38]--[2021-12-10 Fri 07:39] =>  0:01
  CLOCK: [2021-09-30 Thu 10:52]--[2021-09-30 Thu 10:52] =>  0:00
  :END:
Otevřenost je důležitá. Stejně důležité ale také je, jak k ní správně přistupovat. Existuje deset hlavních kroků, které by se měly obecně dodržet:


1. Musí se na to myslet, a to na všech úrovních
1. Při přebírání principů a zásad z IKČR je správně pochopit a adoptovat
1. Do svých principů si dát i ty k otevřenosti a OS
1. Zahrnout OS do své koncepce, architektury, standardů a požadavků
1. Vyžadovat OS ve svých řešeních po dodavatelích
1. Zavést pozitivní bonifikaci otevřených řešení v hodnocení nabídek
1. Udělat si asessment toho, kde už OS mám a kde ho můžu a chci mít
1. Vybudovat si závazná technologická prostředí a vyžadovat je pro nové dodávky
1. Při každé poptávce zjistit, zda existuje OS a primárně poptat ten, teprve pak proprietární řešení
1. Pokud nebude řešení OS, požadovat jeho uvolnění, kódy, práva
1. ...a tohle vše uplatnit i pro stávající systémy a řešení
** NEZAHÁJENO Musí se na to myslet, a to na všech úrovních
** NEZAHÁJENO Při přebírání principů a zásad z IKČR je správně pochopit a adoptovat
** KEKOREKTUŘE Do svých principů si dát i ty k otevřenosti a OS
:LOGBOOK:
CLOCK: [2022-02-10 Thu 08:27]--[2022-02-10 Thu 08:30] =>  0:03
CLOCK: [2022-02-07 Mon 17:34]--[2022-02-07 Mon 17:42] =>  0:08
CLOCK: [2022-02-07 Mon 10:38]--[2022-02-07 Mon 10:44] =>  0:06
CLOCK: [2022-02-07 Mon 10:37]--[2022-02-07 Mon 10:38] =>  0:01
CLOCK: [2022-02-03 Thu 11:24]--[2022-02-03 Thu 11:30] =>  0:06
:END:
Kdykoliv bude organizace tvořit IT strategii, nebo informační koncepci, musí správně adoptovat související principy a zásady z Informační koncepce ČR.

Z IKČR se jedná zejména o následující principy a zásady ICT:
- Architektonický princip EU P4: Otevřenost a transparentnost
- Architektonický princip EU P7: Důvěryhodnost a bezpečnost
- Architektonický princip ČR P13: Otevřená data jako standard
- Architektonický princip ČR P14: Technologická neutralita
- Zásada řízení ICT Z13: Nezávislost návrhu, řízení a kontroly kvality
- Zásada řízení ICT Z16: Využívání otevřeného software a standardů
- Zásada řízení ICT Z17: Podpora vyváženého partnerství s dodavateli
Tyto principy a zásady povinně ze zákona úřad přejímá z úrovně Informační koncepce České republiky na úroveň svojí informační koncepce a povinně adaptuje do svého prostředí, jak na architektonické tak na řídící úrovni. Musí si dobře rozvážit, jak se k těmto principům a zásadám aktivně postaví. Tedy ne je jen tupě překopírovat do svých dokumentů, ale také je fakticky naplňovat. Kromě posouzení jeho IK ze strany ministerstva vnitra se to průběžně u jednotlivých záměrů a projektů  kontroluje také při posuzování žádostí o stanoviska na OHA.
** KEKOREKTUŘE Zahrnout OS do své koncepce, architektury, standardů a požadavků
:LOGBOOK:
CLOCK: [2022-02-10 Thu 09:18]--[2022-02-10 Thu 09:28] =>  0:10
:END:
Kromě přenesení národních princippů a zásad a cílů z IK, musí úřady s oblastí otevřenosti na různých úrovních počítat i ve všech řídících oblastech. Do svých strategií, koncepcí, do své architektury, tam všude je nutno otevřenost promítnout prakticky.
Způsoby konkrétní realizace mohou vypadat kupříkladu takto:
1. Informační koncepce úřadu
    - Do svojí Informační koncepce úřadu přenesu povinně adoptované zásady a principy z Informační koncepce ČR a to včetně těch týkajících se otevřenosti. Principy a zásady jen tupě nepřepíšu jedna mu jedné, ale zamýšlíme se a doplním jejich faktické naplňování v podmínkách mojí organizace či korporací.
    - Zároveň ve své IK úřadu ve vlastních přidaných zásadách si vytvořím takové zásady pro pořízení, rozvoj a správu informačních systémů, aby i tyto interní zásady respektovaly otevřenost na příslušné úrovni.
    - Ve své IK nezapomenu ani na zásady, principy a konkrétní úkoly, které se týkají publikace otevřených dat a zpřístupnění mých dat formou dynamických dat prostřednictvím API rozhraní.
    - Do IK zanesu také konkrétní úkoly, které vedou k větší otevřenosti ICT správy a řešení, včetně maximálního využívání OS platforem, ale třeba i povinnou publikaci pro mne vytvořeného programového kódu tak, aby mnou zadaná programová tvorba mohla být znovu použitá zbytkem veřejné správy.
    - Při formulaci mých zásad pro pořizování a změny informačních systémů si jako jednu ze zásad osvojím právě i realizaci dodávek úprav software tak, aby byl znovupoužitelný. Nezapomenu přitom ani na souvislosti v dokumentaci takového kódu a jeho publikování na vládním či jiném veřejném GIT úložišti.
** NEZAHÁJENO Vyžadovat OS ve svých řešeních po dodavatelích
** NEZAHÁJENO Zavést pozitivní bonifikaci otevřených řešení v hodnocení nabídek
** KEKOREKTUŘE Udělat si asessment toho, kde už OS mám a kde ho můžu a chci mít
   :LOGBOOK:
   CLOCK: [2022-02-03 Thu 11:30]--[2022-02-03 Thu 11:51] =>  0:21
   :END:
Organizace by měla mít přehled o svých ICT řešeních. To platí nejen pro komplexní informační systémy, ale i pro aplikace a infrastrukturní technologie. Součástí tohoto asessmentu má být i znalost a přehled, zda a kde a v jaké míře již organizace otevřená řešení využívá.

To může využít pro argumentaci, že si související principy a zásady otevřenosti plní, ale může to být i základ pro větší otevírání ICT řešení v budoucnu. Velice často se setkáváme s tím, že organizace ani netuší, kde už open-source řešení či platformy využívají a nedokážou si tak ani částečnou otevřenost dostatečně obhájit.
** NEZAHÁJENO Vybudovat si závazná technologická prostředí a vyžadovat je pro nové dodávky
** NEZAHÁJENO Při každé poptávce zjistit, zda existuje OS a primárně poptat ten, teprve pak proprietární řešení
** NEZAHÁJENO Pokud nebude řešení otevřené, požadovat jeho uvolnění, kódy, práva
** ROZPRACOVANÉ a tohle vše uplatnit i pro stávající systémy a řešení
   :LOGBOOK:
   CLOCK: [2022-02-07 po 17:13]--[2022-02-07 po 17:34] =>  0:21
   :END:
